#include <Arduino.h>

// Визначаємо цифровий пін, до якого підключимо зовнішній світлодіод.
// Суфікс _OUT одразу підказує, що цей пін працює на вихід.
// #define LED_OUT 15
constexpr uint8_t LED_OUT = 15; // Визначаємо пін для світлодіода

void setup() {
    // Налаштовуємо пін як вихід (OUTPUT), щоб контролер міг подавати на нього напругу
    pinMode(LED_OUT, OUTPUT);
    Serial.begin(115200); // Ініціалізуємо серійний порт для виводу інформації
}

void loop() {
    digitalWrite(LED_OUT, HIGH); // Вмикаємо світлодіод (подаємо 3.3 В)
    Serial.println("Світлодіод увімкнено"); // Виводимо повідомлення в серійний порт
    delay(1000);                 // Чекаємо 1 секунду (1000 мілісекунд)
    
    
    digitalWrite(LED_OUT, LOW);  // Вимикаємо світлодіод (подаємо 0 В)
    Serial.println("Світлодіод вимкнено"); // Виводимо повідомлення в серійний порт
    delay(1000);                 // Чекаємо 1 секунду
    
}